tests/cassettes/test_tasks/test_successful_payment.yaml

interactions:
- request:
    body: '{"biller_id": 40, "account_number": "501000000007"}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:z8+gPXMjLFJVHa+I2PB4XROvE9M=']
      Connection: [keep-alive]
      Content-Length: ['51']
      Content-MD5: [PtZUYQ9bmh3ULNV0W7ZNdw==]
      Content-Type: [application/json]
      Date: ['Sat, 08 Dec 2018 02:14:38 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bills
  response:
    body: {string: '{"type":"bill","id":8390,"biller_id":40,"account_number":"501000000007","name_on_account":null,"due_date":null,"balance":549.0,"balance_currency":"MXN","balance_updated_at":"2018-12-08T02:14:39Z","error_code":null,"error_message":null,"status":"linked","migrated_at":null,"mfa_challenges":[]}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Sat, 08 Dec 2018 02:14:40 GMT']
      ETag: [W/"1428b25b137f750666b50e985c0ea21b"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [92b004a3-76de-4cbf-9c9a-9da99b22c31d]
      X-Runtime: ['1.059546']
      X-XSS-Protection: [1; mode=block]
    status: {code: 200, message: OK}
- request:
    body: '{"amount": 549.0, "currency": "MXN"}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:tK1fP945o13ZtRjf3NJLzgKVeTY=']
      Connection: [keep-alive]
      Content-Length: ['36']
      Content-MD5: [ze1WRUVApUnpFxTpAr7ygw==]
      Content-Type: [application/json]
      Date: ['Sat, 08 Dec 2018 02:14:40 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bills/8390/pay
  response:
    body: {string: '{"type":"transaction","id":45837,"amount":549.0,"amount_currency":"MXN","fx_rate":1.0,"amount_usd":26.96,"transaction_fee":3.0,"total_usd":27.1,"hours_to_fulfill":0,"created_at":"2018-12-08T02:14:40Z","status":"fulfilled"}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Sat, 08 Dec 2018 02:14:40 GMT']
      ETag: [W/"4acce6cd858c488cadf3b8390435e800"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [f37be098-e6bb-4061-a913-fff964a3e345]
      X-Runtime: ['0.083884']
      X-XSS-Protection: [1; mode=block]
    status: {code: 201, message: Created}
version: 1
