tests/cassettes/test_tasks/test_failed_topup[5599999999-9330-Incomplete payment amount of 93.3, must pay full balance].yaml

interactions:
- request:
    body: '{"biller_id": 13599, "account_number": "5599999999", "amount": 93.3, "currency":
      "MXN", "name_on_account": null}'
    headers:
      Accept: [application/vnd.regalii.v1.6+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:fI+oU+17d3BhYzdXLS5IpjDs/rA=']
      Connection: [keep-alive]
      Content-Length: ['112']
      Content-MD5: [IhGgxrCDERPIeL39hPiEAw==]
      Content-Type: [application/json]
      Date: ['Mon, 28 Jan 2019 18:33:53 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bill/pay
  response:
    body: {string: '{"code":"R3","message":"Invalid Payment Amount","mode":"STAGING"}'}
    headers:
      Cache-Control: [no-cache]
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Mon, 28 Jan 2019 18:33:53 GMT']
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [f8835df6-90b2-4e35-a434-2dfbf91b5bd6]
      X-Runtime: ['0.030397']
      X-XSS-Protection: [1; mode=block]
    status: {code: 422, message: Unprocessable Entity}
version: 1
