tests/cassettes/test_tasks/test_failed_topup[5599999999-9330-Invalid Payment Amount].yaml

interactions:
- request:
    body: '{"biller_id": 13599, "account_number": "5599999999", "amount": 93.3, "currency":
      "MXN", "name_on_account": null}'
    headers:
      Accept: [application/vnd.regalii.v1.6+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth ABCDEFG:evodb8PG8fsXzjIifbgiUJJm+mw=']
      Connection: [keep-alive]
      Content-Length: ['112']
      Content-MD5: [IhGgxrCDERPIeL39hPiEAw==]
      Content-Type: [application/json]
      Date: ['Thu, 17 Jan 2019 17:33:31 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bill/pay
  response:
    body: {string: '{"code":"R3","message":"Invalid Payment Amount","mode":"STAGING"}'}
    headers:
      Cache-Control: [no-cache]
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Thu, 17 Jan 2019 17:33:32 GMT']
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [38cf2c9b-a2eb-46dc-a2fa-2d769d42ef64]
      X-Runtime: ['0.037049']
      X-XSS-Protection: [1; mode=block]
    status: {code: 422, message: Unprocessable Entity}
version: 1
