tests/cassettes/test_tasks/test_successful_topup.yaml

interactions:
- request:
    body: '{"biller_id": 13599, "account_number": "5599999999", "amount": 100.0, "currency":
      "MXN"}'
    headers:
      Accept: [application/vnd.regalii.v1.6+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:iNshg36cEFzCOLpXvdvkXyMqimo=']
      Connection: [keep-alive]
      Content-Length: ['88']
      Content-MD5: [/W0N1EQB5+ilT5qQ3preHg==]
      Content-Type: [application/json]
      Date: ['Sat, 08 Dec 2018 02:15:02 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bill/pay
  response:
    body: {string: '{"id":45838,"external_id":null,"biller_id":13599,"account_number":"5599999999","bill_amount":100.0,"bill_amount_currency":"MXN","fx_rate":1.0,"bill_amount_usd":4.91,"bill_amount_chain_currency":100.0,"payment_transaction_fee":0.0,"payment_total_usd":4.91,"payment_total_chain_currency":100.0,"chain_earned":7.5,"chain_paid":92.5,"starting_balance":172300.09,"ending_balance":172207.59,"hours_to_fulfill":0,"sms_text":null,"created_at":"2018-12-08T02:15:02Z","bill_amount_local_currency":100.0,"local_currency":"MXN","ticket_text":"Pago
        realizado exitosamente Auth: 1544235302"}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Sat, 08 Dec 2018 02:15:02 GMT']
      ETag: [W/"50f9478e78ed0ecb93baee2c929edc91"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [399768aa-9114-4047-bd19-61667cbc972a]
      X-Runtime: ['0.074888']
      X-XSS-Protection: [1; mode=block]
    status: {code: 201, message: Created}
version: 1
