tests/tests/cassettes/test_tasks/test_failed_payment.yaml

interactions:
- request:
    body: '{"biller_id": 37, "account_number": "2424240024"}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:R/v4amj2lItYct5YLZW9D174TFs=']
      Connection: [keep-alive]
      Content-Length: ['49']
      Content-MD5: [ZzalFfx6gqbsDisb9hrS9Q==]
      Content-Type: [application/json]
      Date: ['Wed, 12 Dec 2018 17:49:36 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bills
  response:
    body: {string: '{"type":"bill","id":8395,"biller_id":37,"account_number":"2424240024","name_on_account":null,"due_date":null,"balance":661.0,"balance_currency":"MXN","balance_updated_at":"2018-12-12T17:49:37Z","error_code":null,"error_message":null,"status":"linked","migrated_at":null,"mfa_challenges":[]}'}
    headers:
      Cache-Control: ['max-age=0, private, must-revalidate']
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Wed, 12 Dec 2018 17:49:38 GMT']
      ETag: [W/"24fb809712fe517aaf7145a08c882918"]
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [f5c4bc41-44ea-42dc-8d63-26ce4323aa3e]
      X-Runtime: ['1.059091']
      X-XSS-Protection: [1; mode=block]
    status: {code: 200, message: OK}
- request:
    body: '{"amount": 661.0, "currency": "MXN"}'
    headers:
      Accept: [application/vnd.regalii.v3.1+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:XrQGbXNH1KHyJBHJ7dqgyX/1pL0=']
      Connection: [keep-alive]
      Content-Length: ['36']
      Content-MD5: [fZ1EcCN/zDQtpvtuUqRbDQ==]
      Content-Type: [application/json]
      Date: ['Wed, 12 Dec 2018 17:49:38 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bills/8395/pay
  response:
    body: {string: '{"code":"R24","message":"Timeout from biller","mode":"STAGING"}'}
    headers:
      Cache-Control: [no-cache]
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Wed, 12 Dec 2018 17:49:58 GMT']
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [7979de60-48ed-4692-8278-1fec3d5a6398]
      X-Runtime: ['20.041433']
      X-XSS-Protection: [1; mode=block]
    status: {code: 422, message: Unprocessable Entity}
version: 1
