tests/tests/cassettes/test_tasks/test_failed_topup[5599999999-9330-Invalid Payment Amount].yaml

interactions:
- request:
    body: '{"biller_id": 13599, "account_number": "5599999999", "amount": 93.3, "currency":
      "MXN"}'
    headers:
      Accept: [application/vnd.regalii.v1.6+json]
      Accept-Encoding: ['gzip, deflate']
      Authorization: ['APIAuth 88879c1b066dc9aea6201f27be2bbba9:F1zhywChAIBBM6PcTb/UujrSD2g=']
      Connection: [keep-alive]
      Content-Length: ['87']
      Content-MD5: [aq8YjLEqmGgzY1T5cntczw==]
      Content-Type: [application/json]
      Date: ['Wed, 12 Dec 2018 19:01:02 GMT']
      User-Agent: [python-requests/2.20.1]
    method: POST
    uri: https://api.casiregalii.com/bill/pay
  response:
    body: {string: '{"code":"R3","message":"Invalid Payment Amount","mode":"STAGING"}'}
    headers:
      Cache-Control: [no-cache]
      Connection: [keep-alive]
      Content-Type: [application/json; charset=utf-8]
      Date: ['Wed, 12 Dec 2018 19:01:02 GMT']
      Strict-Transport-Security: [max-age=31536000]
      Transfer-Encoding: [chunked]
      X-Content-Type-Options: [nosniff]
      X-Frame-Options: [SAMEORIGIN]
      X-Request-Id: [73f4a88a-a613-4c22-818b-faf0c877cc92]
      X-Runtime: ['0.024944']
      X-XSS-Protection: [1; mode=block]
    status: {code: 422, message: Unprocessable Entity}
version: 1
